/* 각 릴레이션은 참조할 수 없는 외래키 값을 가질 수 없다. [학생] 릴레이션에서 '교수번호' 속성에는 [교수] 릴레이션의 '교수번호' 속성에 없는 값은 입력할 수 없다.

- 답안: 참조 무결성 제약 조건 */

/* ① 네트워크주소 | 네트워크주소 | 네트워크주소 | 호스트주소 

② 네트워크주소 | 호스트주소 | 호스트주소 | 호스트주소

- 답안: ① C 클래스  ② A 클래스 */

/* 거리 벡터 라우팅 프로토콜, 주기적으로 갱신, 홉(hop), 소규모

- 답안: ㉧ RIP */

/* ① 세그먼트 번호, 데이터스트림

② 소스, 세그먼트위치

- 답안: ① ㉣ sequence  ② ㉢ acknowledgement */

/* #include

int main() {

	int n;

	int sum=0;

	scanf("%d", &n);

	for(int i=0; i <= n; i++)

		sum += i;

	printf("%d", sum);


}

- 답안: 15 */

/* DDL 중 ① 테이블 생성 ② 테이블 수정 ③ 테이블 삭제

- 답안: ① CREATE  ② ALTER  ③ DROP */

/* 보안 메커니즘, 가상 릴레이션(테이블), 물리적 X 논리적 O

- 답안: 뷰(View) */
